pub struct Equalizer {
    pub gains: [f32; 10], // מערך של 10 ערוצים התואם למנוע שלך
}

impl Equalizer {
    pub fn get_preset(preset: &str) -> [f32; 10] {
        match preset {
            "Flat" => [0.0; 10],
            "Rock" => [5.0, 4.0, 3.0, 2.0, 0.0, -1.0, 0.0, 2.0, 3.0, 4.0],
            "Jazz" => [4.0, 3.0, 2.0, 1.0, 0.0, 0.0, 0.0, 1.0, 2.0, 3.0],
            "Classical" => [4.0, 3.0, 2.0, 0.0, 0.0, 0.0, 0.0, 2.0, 3.0, 4.0],
            "Pop" => [2.0, 4.0, 5.0, 4.0, 2.0, 0.0, 0.0, 2.0, 3.0, 3.0],
            "Bass Boost" => [8.0, 6.0, 4.0, 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
            _ => [0.0; 10],
        }
    }

    /// רשימת השמות לתצוגה בתפריט
    pub fn preset_names() -> [&'static str; 6] {
        ["Flat", "Rock", "Jazz", "Classical", "Pop", "Bass Boost"]
    }

    pub fn new() -> Self {
        Self {
            gains: [0.0; 10], // מאותחל ל-0 dB (Flat)
        }
    }

    /// שמות התדרים הסטנדרטיים ל-10 ערוצים לצורך תצוגה ב-GUI
    pub fn labels() -> [&'static str; 10] {
        [
            "29", "59", "119", "237", "474", "947", "1.9k", "3.8k", "7.5k", "15k",
        ]
    }
}
